export const lineToStations = new Map<string, string[]>([
    ["新幹線", ["東京", "品川", "新横浜", "小田原", "熱海", "三島"]],
    ["東北新幹線", ["東京", "上野", "大宮", "小山", "宇都宮"]],
    ["上越新幹線", ["東京", "上野", "大宮", "熊谷", "高崎"]],
    ["北陸新幹線", ["東京", "上野", "大宮", "熊谷", "高崎"]],
    ["東北線", ["東京", "神田", "秋葉原", "上野", "日暮里", "田端", "赤羽", "南浦和", "大宮", "小山", "宇都宮"]],
    ["京浜東北線", ["田端", "赤羽"]],
    ["埼京線", ["池袋", "赤羽", "武蔵浦和", "大宮"]],
    ["常磐線", ["日暮里", "新松戸", "友部"]],
    ["上越線", ["高崎", "新前橋", "渋川"]],
    ["両毛線", ["小山", "新前橋"]],
    ["水戸線", ["小山", "友部"]],
    ["高崎線", ["大宮", "熊谷", "倉賀野", "高崎"]],
    [
        "東海道線",
        [
            "東京",
            "品川",
            "川崎",
            "鶴見",
            "東神奈川",
            "横浜",
            "大船",
            "茅ヶ崎",
            "国府津",
            "小田原",
            "熱海",
            "三島",
            "沼津",
        ],
    ],
    ["総武線", ["東京", "錦糸町", "西船橋", "千葉", "佐倉", "成東", "松岸"]],
    ["御茶水支線 (総武2)", ["錦糸町", "秋葉原", "御茶ノ水"]],
    ["成田線", ["佐倉", "成田", "香取", "松岸"]],
    ["我孫子支線 (成田2)", ["成田", "我孫子"]],
    ["空港支線 (成田3)", ["成田"]],
    ["鹿島線", ["香取"]],
    ["京葉線", ["東京", "市川塩浜", "南船橋", "蘇我"]],
    ["京葉別線 (京葉2)", ["西船橋", "南船橋"]],
    ["京葉別線 (京葉3)", ["西船橋", "市川塩浜"]],
    ["内房線", ["蘇我", "木更津", "館山", "安房鴨川"]],
    ["外房線", ["千葉", "蘇我", "大網", "安房鴨川", "館山"]],
    ["東金線", ["大網", "成東"]],
    ["久留里線", ["木更津"]],
    ["武蔵野線", ["府中本町", "西国分寺", "武蔵浦和", "南浦和", "新松戸", "西船橋"]],
    ["山手線(外", ["品川", "大崎", "代々木"]],
    ["山手線(内", ["日暮里", "田端", "池袋", "新宿"]],
    ["中央東線", ["神田", "御茶ノ水", "代々木", "新宿", "西国分寺", "立川", "八王子"]],
    ["横須賀線 (品鶴線)", ["品川", "武蔵小杉", "鶴見"]],
    ["羽沢支線 (東海道3)", ["鶴見", "羽沢横浜国大"]],
    ["南武線", ["川崎", "尻手", "武蔵小杉", "府中本町", "立川"]],
    ["浜川崎支線 (南武尻手線)", ["尻手", "浜川崎"]],
    ["川越線", ["大宮", "高麗川"]],
    ["八高線", ["八王子", "拝島", "高麗川", "倉賀野"]],
    ["青梅線", ["立川", "拝島"]],
    ["五日市線", ["拝島"]],
    ["鶴見線", ["鶴見", "浅野", "武蔵白石", "浜川崎"]],
    ["海芝浦支線 (鶴見線2)", ["浅野"]],
    ["大川支線 (鶴見線2)", ["武蔵白石"]],
    ["横浜線", ["東神奈川", "新横浜", "橋本", "八王子"]],
    ["横須賀線", ["大船"]],
    ["根岸線", ["横浜", "大船"]],
    ["相模線", ["茅ヶ崎", "橋本"]],
    ["伊東線", ["熱海"]],
    ["御殿場線", ["国府津", "沼津"]],
]);

export const stationToLines = new Map<string, string[]>();

for (const [line, stations] of lineToStations) {
    for (const station of stations) {
        if (!stationToLines.has(station)) {
            stationToLines.set(station, []);
        }
        const lines = stationToLines.get(station);
        if (!lines) {
            continue;
        }
        lines.push(line);
    }
}
